# include<iostream>
using namespace std;

int main24() {

	//for循环语句

	//从数字0打印到数字9

	//for (int i = 0; i < 10; i++)
	//	//  
	//{

	//	cout << i << endl;
	//}


	//for循环中的表达式,是需要用分号来分割

	//while   do...while   for    这三种循环语句都是比较常用的
	// 但是for循环语句结构比较清晰,比较常用



	//练习案例
	//敲桌子

	for (int i = 1; i <= 100; i++)   //这是第一步,首先先输出1-100这些数字
	{
		if (i % 7 == 0 || i % 10 == 7 || i / 10 == 7)   //这是第二步,用if语句进行判断
			//这里 取模7是找7的倍数, 或者取模10找出带7的个位数,  或者十位带7的数字
		{
			cout << "敲桌子" << endl;    //然后碰见带7的数字   直接打印出敲桌子这三个字
		}
		else
		{
			cout << i << endl;//这行代码的意思是   假如不是我们要找的特殊数字的话  才开始打印数字
		}
		
		

	}
	system("pause");

	return 0;

}